export const startMessagePart1 = `
Добро пожаловать в бот «33 удовольствия» уровня “Внимание к себе”

«Внимание к себе» поможет войти в состояние ресурса, потока и осознанности, про которые все так любят говорить, но никто не дает пути, как именно туда прийти.

Уровень «Внимание к себе» состоит из двух практик: «33 удовольствия» и «Осознанность». 

Их следует выполнять параллельно, не обязательно выполнять практики в одно время, одну можно выполнять утром, другую вечером или сначала пройти одну, потом другую. Но важна ежедневность. 
Да, да! Придется включить в ежедневный план такую вещь, как внимание и забота о себе!
`;
export const startMessagePart2 = `
Выполняя обе эти практики Вы получите навыки осознанности, повысите самооценку и точно станете внимательнее к своим процессам.

Подключить бот “Осознанность” можно по ссылке: <ссылка на бота про осознанность>
`;

export const registrationComplete = "Регистрация успешно завершена!";

export const subscriptionWelcomeMessage =
  "Мы рады приветствовать вас в нашем боте «33 удовольствия»! Теперь остался только один шаг - оплатить подписку. Цена составляет всего 299 рублей. После оплаты мы сразу начнем наше совместное путешествие к осознанности и вниманию к себе. Добро пожаловать на борт!";

export const knowUserText = "Мы вас узнали! Добро пожаловать обратно.";

export const incorrectAge =
  "Некорректный возраст. Пожалуйста, введите возраст от 16 до 100 лет.";

export const registrationError = "Произошла ошибка при регистрации.";

export const paymentError = "Произошла ошибка при обработке вашей оплаты.";

export const successfulSubscriptionMessage = `
🎉 Поздравляем, вы подписались на технику «33 удовольствия»! Сегодня начинается новая глава вашей жизни. Ваше первое задание - составить список из 33 простых удовольствий, которые приносят вам радость. 🌟

✅ Эти маленькие радости помогут вам в моменты, когда нужен прилив сил или мотивация. Ваш список - это ваш индивидуальный дневник чувств. Каждый день присылайте сюда фото и текстовый отчет о вашем удовольствии. 📸📝

🕒 Задание займет всего 15 минут в день. Отключите все отвлекающие уведомления и будьте 'здесь и сейчас'. Вечером вам придет сообщение с номером удовольствия для выполнения на следующий день. 🌙

🔄 За каждый выполненный отчет вы получите баллы и сможете общаться с друзьями о практике. Откройте для себя новые способы радости и удовольствия! Вперед к новым открытиям! 💪
`;

export const preSubscriptionText = "Вы уже совсем близко, осталось только";

export const completionMessage = `
🌟 После успешного выполнения задания, давай добавим красивый финальный штрих! 🚀 Пожалуйста, поделись своим опытом в форме короткого отчета:

📸 Присоедини фото, которое символизирует момент твоего триумфа!
📝 Напиши несколько слов о том, как ты себя чувствовал во время выполнения задания.
😊 Выбери эмодзи, которое отражает твои эмоции в этот момент.
Твой отчет добавит особое волшебство! ✨ Спасибо за твои усилия! 🌈 

Твой отчет будет проверен нашими специалистами. 🧐💬
`;

export const seeYouTomorrowMessage = `
Поздравляю! Вы успешно завершили текущее задание. Отличная работа! 🎉

Не забывайте отдыхать и заботиться о себе. Новое задание будет доступно завтра. Оставайтесь с нами!

Если у вас есть вопросы или нужна помощь, не стесняйтесь спрашивать. Удачи! 💪
`;
