export const startMessagePart1 = `Привет! Это я, бот «33 удовольствия» уровня “Внимание к себе”

«Внимание к себе» поможет войти в состояние ресурса, потока и осознанности, про которые все так любят говорить, но никто не говорит как именно это сделать.

Сегодня ты начнешь свой путь к уверенности в себе и ежедневной радости, которую поможет тебе получить бот 33 удовольствия. Ежедневно ты будешь получать задание, которое надо обязательно выполнить. Я буду мотивировать тебя каждый день, невзирая на погоду.

Я не устану напоминать тебе заботиться о себе, так как в этом деле важна периодичность. Да, да! Придется включить в ежедневный план такую вещь, как внимание и забота о себе!`;

export const startMessagePart2 = `
Выполняя эту практику ты получишь навыки осознанности, повысишь самооценку и точно станешь внимательнее к своим процессам.

Итак, поехали:
`;

export const knowUserText = "Мы вас узнали! Добро пожаловать обратно.";

export const registrationComplete = "Регистрация успешно завершена!";

export const subscriptionWelcomeMessage = `Мы рады приветствовать тебя в нашем боте «33 удовольствия»! Теперь остался только один шаг - оплатить подписку.

Как я и обещал, это в десятки раз дешевле психолога. Цена составляет всего 299 рублей. После оплаты мы сразу начнем наше совместное путешествие к твоему успеху и радости жизни. Добро пожаловать на борт!`;

export const incorrectAge =
  "Некорректный возраст. Пожалуйста, введите возраст от 16 до 100 лет.";

export const registrationError = "Произошла ошибка при регистрации.";

export const paymentError = "Произошла ошибка при обработке вашей оплаты.";

export const successfulSubscriptionMessage = `🎉 Поздравляем, ты подписался на технику «33 удовольствия»! Сегодня начинается новая глава твой жизни.

Твое первое задание - составить список из 33 простых удовольствий, которые приносят тебе радость.

✅ Эти маленькие радости помогут тебе в моменты, когда нужен прилив сил или мотивация. Твой список - это твой индивидуальный дневник чувств. Каждый день присылай сюда фото и текстовый отчет о вашем удовольствии. 📸📝

🕒 Задание займет всего 15 минут в день. При выполнении задания отключи все отвлекающие уведомления и будь 'здесь и сейчас'.

🔄 Самое главное это фиксировать те чувства которые ты испытываешь выполняя задания и отправлять их описание в виде отчета в бот. За каждый выполненный отчет ты получишь баллы и сможешь общаться с друзьями о практике. Открой для себя новые способы радости и удовольствия! Вперед к новым открытиям! 💪

Жми "Перейти к заданиям`;

export const preSubscriptionText = "Оплатить подписку";

export const completionMessage = `!!!САМЫЙ ВАЖНЫЙ ШАГ!!! 🌟 После успешного выполнения задания, давай добавим красивый финальный штрих! 🚀 Пожалуйста, поделись своим опытом в форме короткого отчета:

📸 Присоедини фото, которое символизирует момент твоего триумфа!
📝 Напиши несколько слов о том, как ты себя чувствовал во время выполнения задания.
😊 Выбери эмодзи, которое отражает твои эмоции в этот момент.
✨Твой отчет добавит особое волшебство!
🌈Спасибо за твои усилия!

Твой отчет будет проверен нашими специалистами. 🧐💬`;

export const seeYouTomorrowMessage = `
Поздравляю! Вы успешно завершили текущее задание. Отличная работа! 🎉

Не забывайте отдыхать и заботиться о себе. Новое задание будет доступно завтра. Оставайтесь с нами!

Если у вас есть вопросы или нужна помощь, не стесняйтесь спрашивать. Удачи! 💪
`;
export const taskListPrompt = `Твой список заданий готов! Хочешь добавить свои дополнительные задания?

Ты можешь написать все задания самостоятельно, а можешь воспользоваться созданными нами заданиями. Что бы не писать задания просто нажми кнопку "далее". Или нажми "добавить свое задание" и напиши одно из своих удовольствий.

ВНИМАНИЕ! ЗАДАНИЯ СЛЕДУЕТ ДОБАВЛЯТЬ ПО ОДНОМУ!`;


export const preHelpText = 'Пожалуйста, опишите проблему, с которой Вы столкнулись или то, что Вас заинтересовало. Мы перешлем Ваше сообщение нашим специалистам!'